{
    "job_details": {
        "source": "Indeed",
        "platform": "indeed",
        "job_title": "Senior Project Management Specialist – B-52H",
        "company": "BOEING",
        "company_rating": "3.9 out of 5 stars",
        "location": "Oklahoma City, OK",
        "location_detail": null,
        "employment_type": "Full-time",
        "pay_currency": "USD",
        "pay_min_annual": 105400,
        "pay_max_annual": 177100,
        "pay_rate_type": "year",
        "pay_display": "$105,400 - $177,100 a year",
        "remote_type": "onsite",
        "job_post_url": "https://www.indeed.com/viewjob?jk=17e388c9723447ea",
        "apply_url": "https://www.indeed.com/cmp/Boeing?campaignid=mobvjcmp&from=mobviewjob&tk=1je4jcgspgmui800&fromjk=17e388c9723447ea",
        "security_clearance_required": "Secret",
        "security_clearance_preferred": null,
        "work_model": "onsite",
        "work_model_notes": "This position is expected to be 100% onsite. The selected candidate will be required to work onsite at one of the listed location options.",
        "posting_age": null,
        "job_board_list_context": {
            "search_keywords": "boeing",
            "search_location": "Oklahoma City, OK",
            "search_radius_miles": 25,
            "employer_group_page": "Boeing Jobs near Oklahoma City, OK"
        }
    },
    "benefits": {
        "listed_benefits": [
            "Health insurance",
            "401(k) matching",
            "Health savings account",
            "Flexible spending account",
            "Disability insurance"
        ],
        "benefits_text": "The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work. The Boeing 401(k) helps you save for your future, with contributions from Boeing that can help you grow your retirement savings. Our best-in-class retirement benefit features: Best in class 401(k) plan: we'll match your contributions dollar for dollar, up to 10% of eligible pay with immediate 100% vesting. Student Loan Match: The Boeing 401(k) Student Loan Match allows eligible enrolled U.S. employees to have their qualified student loan debt payments counted.",
        "eligibility_notes": "The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.",
        "relocation": "Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense.",
        "sign_on_bonus": null
    },
    "job_description": {
        "headline": "Senior Project Management Specialist – B-52H",
        "short_summary": "Support the B-52H software portfolio and programs by independently developing, coordinating, integrating, analyzing, and maintaining integrated plans and schedules to meet program and project requirements in accordance with industry standards.",
        "full_text": "At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\n\nBoeing Defense, Space and Security (BDS)\nhas an exciting opportunity for a\nSenior Project Management Specialist\n(Level 4 or 5) to support the\nB-52H\nsoftware portfolio and programs in\nOklahoma City, OK.\n\nA Project Management Specialist is responsible for independently developing, coordinating, integrating, analyzing, and maintaining integrated plans and schedules to meet program and project requirements in accordance with industry standards.\n\nThis role involves conducting studies and performing various analyses, including trend, variance, and impact assessments, as well as risk assessments to determine impacts and constraints related to product development, process improvement, and program initiatives.\n\nProvide oversight and management responsibility (including performance management & reporting) for a portfolio of small to medium size Software Engineering Assignments (EA) and Engineering Projects (EP) in support of organizational goals and objectives. Creates schedules, reports, and metrics, manages change activities, and regularly communicates updates throughout the project lifecycle. Additionally, work to improve project management processes and business systems, implement best practices, and direct all phases of projects or subsystems from inception through completion. Acting as the primary project contact, establish key stakeholder requirements and project objectives, assist customers in developing performance recovery plans, and ensure all project control systems are in place to support ongoing stakeholder needs.\n\nStrong communication and organizational skills are critical to success in this position, along with the ability to build strong relationships, collaborate in a cross-functional environment, and utilize problem-solving skills to proactively identify and manage risks and opportunities.\n\nPosition Responsibilities:\n\n•  Independently develop, coordinate, integrate, analyze, and maintain an integrated plan and schedule to meet program and/or project requirements in accordance with project management industry standards\n•  Conduct studies and perform analysis such as trend, variance, and impact assessments\n•  Perform risk assessments to determine impacts and constraints involving product development, production rates, process improvement, and program initiatives\n•  Create schedules, reports, and metrics\n•  Manage change activity and communicate updates to the plan regularly throughout the lifecycle of the program or project\n•  Work to improve project management processes and business systems\n•  Implement best practices that support project decision-makers\n•  Direct all phases of projects or subsystems of major projects from inception through completion\n•  Act as the primary project contact to establish key stakeholder requirements and project objectives\n•  Assist customers in developing performance recovery plans\n•  Ensure all project control systems are in place to support ongoing support to stakeholders\n\nThis position is expected to be 100% onsite. The selected candidate will be required to work onsite at one of the listed location options.\n\nThis position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship.\nAn interim and/or final U.S. Secret Clearance Post-Start is required.\n\nBasic Qualifications (Required Skills/Experience):\n\n•  5+ years of experience leading projects and/or teams\n•  Experience using Program Management Best Practices (PMBP) and processes and methods\n•  Strong communication, problem solving and analytical skills\n\nPreferred Qualifications (Desired Skills/Experience):\n\n•  Bachelor's Degree or higher\n•  Knowledge of Boeing program management processes and tools\n•  Experience in Enterprise Standard Gated Process (ESGP) processes\n•  Experience in preparing and presenting executive level briefings\n•  Level 4 & 5: 5 or more years' related work experience or an equivalent combination of education and experience\n\nRelocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense.\n\nTravel:\nOccasional travel may be required\n\nShift:\n1st Shift\n\nDrug Free Workplace:\n\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nTotal Rewards & Pay Transparency:\n\nAt Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities.\n\nThe Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.\n\nThe specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.\n\nThe Boeing 401(k) helps you save for your future, with contributions from Boeing that can help you grow your retirement savings. Our best-in-class retirement benefit features:\n\n•  Best in class 401(k) plan: we'll match your contributions dollar for dollar, up to 10% of eligible pay with immediate 100% vesting\n•  Student Loan Match: The Boeing 401(k) Student Loan Match allows eligible enrolled U.S. employees to have their qualified student loan debt payments counted, along with any match-eligible contributions they make, for purposes of determining the Company Match to employees' Boeing 401(k) accounts.\n\nPay is based upon candidate experience and qualifications, as well as market and business considerations.\n\nSummary pay range:\n\nLevel 4 $105,400 - $142,600\n\nLevel 5 $130,900 - $177,100\n\nApplications for this position will be accepted until January 4, 2026\n\nApplications for this position will be accepted until\nJan. 05, 2026\n\nExport Control Requirements:\n\nThis position must meet U.S. export control compliance requirements. To meet U.S. export control compliance requirements, a 'U.S. Person' as defined by 22 C.F.R. §120.62 is required. 'U.S. Person' includes U.S. Citizen, U.S. National, lawful permanent resident, refugee, or asylee.\n\nExport Control Details:\n\nUS based job, US Person required\n\nRelocation\n\nRelocation assistance is not a negotiable benefit for this position.\n\nSecurity Clearance\n\nThis position requires the ability to obtain a U.S. Security Clearance for which the U.S. Government requires U.S. Citizenship. An interim and/or final U.S. Secret Clearance Post-Start is required.\n\nVisa Sponsorship\n\nEmployer will not sponsor applicants for employment visa status.\n\nShift\n\nThis position is for 1st shift\n\nEqual Opportunity Employer:\n\nBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.",
        "required_experience_years_min": 5,
        "required_education": null,
        "must_have_skills": [
            "Leading projects and/or teams (5+ years)",
            "Program Management Best Practices (PMBP) and processes and methods",
            "Strong communication skills",
            "Problem solving skills",
            "Analytical skills"
        ],
        "nice_to_have_skills": [
            "Bachelor's Degree or higher",
            "Knowledge of Boeing program management processes and tools",
            "Enterprise Standard Gated Process (ESGP) processes experience",
            "Executive level briefing preparation and presentation experience"
        ]
    }
}
