{
    "job_details": {
        "source": "Indeed",
        "platform": "indeed",
        "jobtitle": "Systems Engineering Manager 2",
        "company": "Northrop Grumman",
        "companyrating": "4.0 out of 5 stars",
        "location": "Oklahoma City, OK",
        "locationdetail": "6401 S Air Depot Blvd, Oklahoma City, OK 73135",
        "employmenttype": "Full-time",
        "paycurrency": "USD",
        "payminannual": 131800,
        "paymaxannual": 197800,
        "payratetype": "year",
        "paydisplay": "$131,800 - $197,800 a year",
        "remotetype": "onsite",
        "jobposturl": "https://www.indeed.com/jobs?q=northrop+grumman&latLong=35.46756%2C-97.51643&locString=Oklahoma+City%2C+OK&radius=25&from=searchOnDesktopSerp&vjk=769febc2e2249e6e",
        "applyurl": null,
        "securityclearancerequired": "Secret",
        "securityclearancepreferred": null,
        "workmodel": "onsite",
        "workmodelnotes": "Travel: Yes, 10% of the Time",
        "postingage": null
    },
    "jobboardlistcontext": {
        "searchkeywords": "northrop grumman",
        "searchlocation": "Oklahoma City, OK",
        "searchradiusmiles": 25,
        "employergrouppage": null
    },
    "benefits": {
        "listedbenefits": [
            "Health insurance",
            "Paid time off",
            "Relocation assistance",
            "Disability insurance",
            "Paid holidays",
            "Life insurance",
            "Savings plan",
            "Company paid holidays",
            "Overtime pay",
            "Shift differential",
            "Discretionary bonus",
            "Annual bonuses"
        ],
        "benefitstext": "Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.",
        "eligibilitynotes": "The above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.",
        "relocation": "Relocation assistance may be available",
        "signonbonus": null
    },
    "jobdescription": {
        "headline": "Systems Engineering Manager 2",
        "shortsummary": "Lead a diverse team of electrical, mechanical, aerospace, and systems engineers for Northrop Grumman's Integrated Mission Solutions providing sustainment support for US Air Force B-1, KC-135, and other Government platforms.",
        "fulltext": "RELOCATION ASSISTANCE: Relocation assistance may be available\nCLEARANCE TYPE: Secret\nTRAVEL: Yes, 10% of the Time\n\nDescription\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nOur Defense Systems Sector is seeking a Systems Engineering Manager to join our growing team in Oklahoma City, Oklahoma.\n\nYou will become part of Northrop Grumman's Integrated Mission Solutions (IMS). IMS provides sustainment support for the US Air Force B-1, KC-135, and numerous other Government platforms. Our team members complete engineering, reverse engineering, and logistics solution efforts to solve complex obsolescence problems and ensure warfighter supportability.\n\nThis Systems Engineer Manager will lead a diverse team of electrical, mechanical, aerospace, and systems engineers to achieve organizational goals. They will provide engineering oversight for efforts within an Integrated Product Team (IPT), to include technical planning, requirements development and tracking, system integration, systems integrations lab (SIL), ground and flight testing, verification and validation, airworthiness, system safety, risk, reliability / maintainability, and supportability and effectiveness analyses for total systems. Analyses are performed at all levels of total system product to include concept, requirements, design, fabrication, test, installation, operation, maintenance and disposal. This person will lead project teams and be responsible for cost, schedule and performance.\n\nResponsibilities:\n• Direct supervision/management of the staff\n• Create project plans, including project schedules and budgets\n• Oversee and manage project execution and finances to the plan\n• Integrate requirements vertically and horizontally across the project to ensure successful execution\n• Brief Northrop Grumman management and customers on project status\n• Identify and mitigate risks\n• Communicate staffing and lab needs to ensure projects are adequately resourced\n• Work with multiple engineering teams and cross-functional departments\n• Lead business development and proposal activities for new projects\n\nBasic Qualifications:\n• Bachelor's degree in a Science, Technology, Engineering or Mathematics (STEM) discipline from an accredited university with 8 years of engineering leadership experience or master's degree with 6 years of engineering leadership experience\n• Some background in aircraft engineering or maintenance\n• Demonstrated expertise in system engineering processes and products throughout much of the program life cycle and providing technical leadership and guidance\n• Ability to develop, execute, and manage a complex WBS and IMS via MS Project\n• DoD Secret clearance required and the ability to gain program access\n• Experience in managing both internal and external personnel and teams to include subcontractors\n• Understanding and experience in formal risk and opportunity management\n\nPreferred Qualifications:\n• General understanding of NGDS Engineering processes\n• Experience with DoD, B-1, and KC-135 aircraft systems\n• Understanding and experience in earned value management\n• Previous experience holding responsibility for cost, schedule and profit\n• Proven performance as a Systems Engineering Leader in many of the phases of acquisition, design, integration, and execution. Candidate will require ability to rapidly assess and lend guidance to projects assigned to the organizational group as well as demonstrated mentoring and guidance to engineers.\n• Ability to assess program health and performance based on alignment of governing products and delivery schedules: SEMP, CLIN, IMP, WBS, IMS, manufacturing and sustainment plans\n• Understanding of the application and development of functional and physical architectures, interfaces, requirements analysis, functional decomposition, design synthesis, integration, verification, and validation in large systems using SysML/UML and requirements management tools such as Rhapsody, and DOORS\n• Experience working on DoD related projects\n• Experience presenting project performance to upper management and customers\n\nPrimary Level Salary Range: $131,800.00 - $197,800.00\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nDepending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO and pay transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.",
        "requiredexperienceyearsmin": 8,
        "requirededucation": "Bachelor's degree in a Science, Technology, Engineering or Mathematics (STEM) discipline from an accredited university",
        "musthaveskills": [
            "Aircraft engineering or maintenance background",
            "System engineering processes and products expertise",
            "Technical leadership and guidance",
            "Complex WBS and IMS management via MS Project",
            "DoD Secret clearance (or ability to obtain)",
            "Managing internal and external personnel and teams including subcontractors",
            "Formal risk and opportunity management",
            "U.S. Citizenship"
        ],
        "nicetohaveskills": [
            "NGDS Engineering processes understanding",
            "DoD, B-1, and KC-135 aircraft systems experience",
            "Earned value management",
            "Cost, schedule and profit responsibility",
            "Systems Engineering Leader in acquisition, design, integration, and execution phases",
            "Mentoring and guidance to engineers",
            "SEMP, CLIN, IMP, WBS, IMS, manufacturing and sustainment plans assessment",
            "SysML/UML expertise",
            "Rhapsody and DOORS requirements management tools",
            "DoD projects experience",
            "Presenting to upper management and customers"
        ]
    }
}
