{
    "job_details": {
        "source": "Indeed",
        "platform": "indeed",
        "jobtitle": "PSM OU Chief Systems Engineer Architect",
        "company": "Northrop Grumman",
        "companyrating": "4.0 out of 5 stars",
        "location": "Oklahoma City, OK",
        "locationdetail": "6401 S Air Depot Blvd, Oklahoma City, OK 73135",
        "employmenttype": "Full-time",
        "paycurrency": "USD",
        "payminannual": 139900,
        "paymaxannual": 244800,
        "payratetype": "year",
        "paydisplay": "$139,900 - $244,800 a year",
        "remotetype": "onsite",
        "jobposturl": "https://www.indeed.com/jobs?q=northrop+grumman&latLong=35.46756%2C-97.51643&locString=Oklahoma+City%2C+OK&radius=25&from=searchOnDesktopSerp&vjk=74b5cb89fb34fd36",
        "applyurl": null,
        "securityclearancerequired": "Secret",
        "securityclearancepreferred": "TS/SCI",
        "workmodel": "onsite",
        "workmodelnotes": "Travel: Yes, 10% to 25% of the Time depending on location. Preferred location is Lake Charles, LA; candidates also considered for Baltimore, MD or Oklahoma City, OK",
        "postingage": null
    },
    "jobboardlistcontext": {
        "searchkeywords": "northrop grumman",
        "searchlocation": "Oklahoma City, OK",
        "searchradiusmiles": 25,
        "employergrouppage": null
    },
    "benefits": {
        "listedbenefits": [
            "Health insurance",
            "Paid time off",
            "Relocation assistance",
            "Disability insurance",
            "Paid holidays",
            "Life insurance",
            "Savings plan",
            "Company paid holidays",
            "Overtime pay",
            "Shift differential",
            "Discretionary bonus",
            "Annual bonuses",
            "Long Term Incentives (for VP/Director positions)"
        ],
        "benefitstext": "Depending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.",
        "eligibilitynotes": "The above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.",
        "relocation": "Relocation assistance may be available",
        "signonbonus": null
    },
    "jobdescription": {
        "headline": "PSM OU Chief Systems Engineer Architect",
        "shortsummary": "Chief Technical Systems Engineering Architect for the Platform Systems Modernization (PSM) Operating Unit, serving as the nexus of Business Development, Strategy, and Technology, managing IRAD efforts and ensuring technical vision alignment across the organization.",
        "fulltext": "RELOCATION ASSISTANCE: Relocation assistance may be available\nCLEARANCE TYPE: Secret\nTRAVEL: Yes, 25% of the Time\n\nDescription\n\nAt Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work — and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.\n\nNorthrop Grumman Defense Systems (NGDS) is seeking a Chief Technical Systems Engineering Architect for the Platform Systems Modernization (PSM) Operating Unit (OU).\n\nThe preferred location for this position is the Northrop Grumman Lake Charles, LA office; however, candidates will also be considered that are located at (or can relocate to) the Baltimore, MD area or the Oklahoma City, OK area.\n\nThis position is the nexus of Business Development, Strategy, and Technology for the PSM OU, and includes the following responsibilities:\n\n• Managing Internal Research and Development (IRAD) efforts for the OU, to include IRAD proposals, planning, and oversight.\n• Lead cross organization technical collaboration on IRAD and captures (cross BU and Division).\n• Ensure the technical vision and roadmap for the OU are aligned to Business Unit (BU), Division, and Sector technology interests and strategic objectives.\n• Ensure that required processes and procedures are followed to ensure technical solutions across the OU meet quality standards.\n• Consulting or leading technical solutioning for capture efforts and participating in proposal development and reviews.\n• Ensuring appropriate collaboration technical leads across the OU and the programs that they represent.\n• Will be the primary technical focal point for the OU Engineering Lead and the OU Director.\n\n**Travel will be approximately 10% to 25% depending on where the selected Candidate is actually located. (Lake Charles, LA., Middle River, MD., or Oklahoma City, OK.)\n\nBasic Qualifications:\n• U.S. Citizenship\n• A Bachelor's degree with a minimum of 14 years of experience - OR\n• A Master's degree with a minimum of 12 years of experience - OR\n• A PhD with a minimum of 9 years of experience\n• Current DoD Secret or higher security clearance with ability to obtain a TS/SCI clearance.\n• Experience leading or participating in the responses to 5+ proposal solicitations.\n• IRAD planning / execution experience.\n• Familiarity with aviation maintenance, integration, and modernization efforts across multiple platforms\n• Experience deploying solutions across multiple programs and encouraging cross-program knowledge sharing.\n• Demonstrated technical leadership skills, decisiveness, and ability to make sound technical judgments with limited information.\n• Ability to comprehend and analyze complex problems and develop solutions.\n• Strong interpersonal skills to communicate effectively with technical and business leadership.\n\nPreferred Qualifications:\n• Active TS/SCI Security Clearance\n• Advanced degree in STEM or technical management\n• Experience architecting solutions to meet DoD requirements.\n• Airworthiness experience including FAA Designated Engineering Representative (DER) or equivalent US Navy NavDER authorizations\n• Experience leading the responses to proposal solicitations, including architecture definition, BOE generation, and written volume creation.\n• Experience with program audits and subsequent responses.\n• Experience with BAAs and RFI responses.\n• Experience coordinating with external subcontractors and suppliers.\n\nPrimary Level Salary Range: $139,900.00 - $244,800.00\n\nThe above salary range represents a general guideline; however, Northrop Grumman considers a number of factors when determining base salary offers such as the scope and responsibilities of the position and the candidate's experience, education, skills and current market conditions.\n\nDepending on the position, employees may be eligible for overtime, shift differential, and a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n\nThe application period for the job is estimated to be 20 days from the job posting date. However, this timeline may be shortened or extended depending on business needs and the availability of qualified candidates.\n\nNorthrop Grumman is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO and pay transparency statement, please visit http://www.northropgrumman.com/EEO. U.S. Citizenship is required for all positions with a government clearance and certain other restricted positions.",
        "requiredexperienceyearsmin": 14,
        "requirededucation": "Bachelor's degree with 14 years of experience OR Master's degree with 12 years of experience OR PhD with 9 years of experience",
        "musthaveskills": [
            "U.S. Citizenship",
            "Current DoD Secret or higher security clearance (with ability to obtain TS/SCI)",
            "Experience leading or participating in 5+ proposal solicitations",
            "IRAD planning and execution experience",
            "Aviation maintenance, integration, and modernization across multiple platforms",
            "Deploying solutions across multiple programs",
            "Cross-program knowledge sharing",
            "Technical leadership skills and decisiveness",
            "Sound technical judgment with limited information",
            "Complex problem analysis and solution development",
            "Strong interpersonal skills for technical and business communication"
        ],
        "nicetohaveskills": [
            "Active TS/SCI Security Clearance",
            "Advanced degree in STEM or technical management",
            "Architecting solutions to meet DoD requirements",
            "Airworthiness experience (FAA DER or US Navy NavDER)",
            "Leading proposal responses including architecture definition, BOE generation, and written volume creation",
            "Program audits and responses experience",
            "BAAs and RFI responses",
            "Coordinating with external subcontractors and suppliers",
            "Proposal writing",
            "Decision making",
            "Cross-functional communication"
        ]
    }
}
